## https://www.kaggle.com/c/instacart-market-basket-analysis

- aisles.csv       

- order_products__prior.csv  

- orders.csv    

- sample_submission.csv

- departments.csv

- order_products__train.csv

- products.csv

### instructions:

> order_products_prior give the order information of all users in the history. order_products_train give the current order information of some users. You need to predict the current order of rest of users.

In [1]:
import numpy as np
import pandas as pd
import pickle

from tqdm import *

In [2]:
DATA_ROOT = "/media/felipe/ssd_vol/instacart/"
PICKLE_ROOT = DATA_ROOT+"pickles/"

In [3]:
aisles_df = pd.read_csv(DATA_ROOT+"aisles.csv")

In [4]:
last_items_ordered_df = pd.read_csv(DATA_ROOT+"order_products__train.csv")

In [5]:
orders_df = pd.read_csv(DATA_ROOT+"/orders.csv")

In [6]:
departments_df = pd.read_csv(DATA_ROOT+"/departments.csv")

In [7]:
products_df = pd.read_csv(DATA_ROOT+"/products.csv")

In [8]:
prior_items_ordered_df = pd.read_csv(DATA_ROOT+"order_products__prior.csv")

## aisles

In [9]:
aisles_df.sample(5)

    aisle_id                 aisle
52        53                 cream
16        17    baking ingredients
42        43            buns rolls
25        26                coffee
57        58  frozen breads doughs

## departments

In [10]:
departments_df.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

## products

In [11]:
products_df.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [12]:
len(products_df)

49688

In [13]:
max(products_df["product_id"])

49688

## orders

In [14]:
orders_df.sample(10)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
472720,721712,28489,prior,3,2,11,27.0
600957,1408694,36247,prior,42,1,10,9.0
1802093,2185926,108244,prior,14,6,17,6.0
1404836,3032455,84399,prior,2,0,12,6.0
2861855,2940277,172679,prior,9,1,13,29.0
2458632,2894297,147973,train,4,6,18,2.0
1248179,2268616,75035,prior,4,6,16,8.0
470021,1908628,28345,prior,12,1,17,7.0
1370285,2202098,82359,prior,6,1,16,7.0
96988,2436129,5873,prior,14,3,14,30.0

In [15]:
orders_df.groupby('eval_set').count()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
eval_set,,,,,,
prior,3214874,3214874,3214874,3214874,3214874,3008665
test,75000,75000,75000,75000,75000,75000
train,131209,131209,131209,131209,131209,131209

In [16]:
len(orders_df[orders_df['eval_set']=='test']['order_id'].unique())

75000

In [17]:
last_items_ordered_df.sample(10)

         order_id  product_id  add_to_cart_order  reordered
1125895   2783184       40120                  6          0
523082    1284842       15902                 15          0
859845    2122096        8803                  2          1
1262821   3120259       14147                 10          1
409960    1003595         859                  3          0
637976    1570842        5769                  5          1
1208413   2984595       33198                  3          1
1078398   2665986       46307                 10          0
149303     364851        3298                  9          0
1102755   2725536       35842                 11          1

### users_df, derived

In [18]:
users_df = orders_df[["user_id"]]

In [19]:
users_df = users_df.drop_duplicates().reset_index().drop('index',axis=1)

In [20]:
users_df.head()

   user_id
0        1
1        2
2        3
3        4
4        5

## denormalizing

In [21]:
last_items_ordered_df = pd.merge(last_items_ordered_df,orders_df,on='order_id',how='left')

In [22]:
prior_items_ordered_df = pd.merge(prior_items_ordered_df,orders_df,on='order_id',how='left')

In [23]:
unique_user_ids = set(orders_df.groupby('user_id').groups.keys())

In [24]:
len(unique_user_ids)

206209

In [25]:
unique_product_ids = set(products_df['product_id'].values)

In [26]:
len(unique_product_ids)

49688

## what is the static reorder_factor for each user?

I.e. what percentage of products is reordered?

> since we need data from both the prior as from the last dataframes, we need to calculate sum and counts separately, because mean of means would not be correctly weighted.

In [27]:
users_df['reorder_cl'] = last_items_ordered_df.groupby('user_id')['reordered'].count()
users_df['reorder_sl'] = last_items_ordered_df.groupby('user_id')['reordered'].sum()

users_df['reorder_cp'] = prior_items_ordered_df.groupby('user_id')['reordered'].count()
users_df['reorder_sp'] = prior_items_ordered_df.groupby('user_id')['reordered'].sum()


users_df['user_reorder_factor'] = (users_df['reorder_sl'] + users_df['reorder_sp']) / (users_df['reorder_cl'] + users_df['reorder_cp'])

users_df.drop(['reorder_cl','reorder_sl','reorder_cp','reorder_sp'],axis=1,inplace=True)

In [28]:
users_df.head()

   user_id  user_reorder_factor
0        1                  NaN
1        2             0.728571
2        3             0.464602
3        4                  NaN
4        5                  NaN

In [29]:
to_save = users_df[["user_id","user_reorder_factor"]]
to_save.set_index("user_id",inplace=True)
pickle.dump(to_save.to_dict()['user_reorder_factor'],open(PICKLE_ROOT+"static_user_reorder_factors.p","wb"))

## now do the same for each product

In [30]:
# last orders
products_df['reorder_cl'] = last_items_ordered_df.groupby('product_id')['reordered'].count()
products_df['reorder_sl'] = last_items_ordered_df.groupby('product_id')['reordered'].sum()

# prior orders
products_df['reorder_cp'] = prior_items_ordered_df.groupby('product_id')['reordered'].count()
products_df['reorder_sp'] = prior_items_ordered_df.groupby('product_id')['reordered'].sum()

products_df['product_reorder_factor'] = (products_df['reorder_sl'] + products_df['reorder_sp']) / (products_df['reorder_cl'] + products_df['reorder_cp'])

products_df.drop(['reorder_cl','reorder_sl','reorder_cp','reorder_sp'],axis=1,inplace=True)

In [31]:
products_df.head(10)

,product_id,product_name,aisle_id,department_id,product_reorder_factor
0,1,Chocolate Sandwich Cookies,61,19,NaN
1,2,All-Seasons Salt,104,13,0.614627
2,3,Robust Golden Unsweetened Oolong Tea,94,7,0.138298
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,0.738516
4,5,Green Chile Anytime Sauce,5,13,0.458689
5,6,Dry Nose Oil,11,11,0.625000
6,7,Pure Coconut Water With Orange,98,7,NaN
7,8,Cut Russet Potatoes Steam N' Mash,116,1,0.419355
8,9,Light Strawberry Blueberry Yogurt,120,16,0.505618
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,0.521739

In [32]:
product_factors = products_df[["product_id","product_reorder_factor"]]
product_factors.set_index("product_id",inplace=True)
pickle.dump(product_factors.to_dict()['product_reorder_factor'],open(PICKLE_ROOT+"static_product_reorder_factors.p","wb"))

In [33]:
product_factors.head()

            product_reorder_factor
product_id
1                              NaN
2                         0.614627
3                         0.138298
4                         0.738516
5                         0.458689

### what are all products ever ordered by each user in the test set?

>  ONLY THE LAST ORDER MADE BY THE USER (except the order in the test set, obviously)

In [34]:
users_in_test_set = orders_df[orders_df['eval_set']=='test'][["user_id","order_id","order_number"]]

In [77]:
users_in_test_set.head(10)

     user_id  order_id  order_number
38         3   2774568            13
44         4    329954             6
53         6   1528013             4
96        11   1376945             8
102       12   1356845             6
152       15   2161313            23
159       16   1416320             7
217       19   1735923            10
222       20   1980631             5
272       22    139655            16

In [36]:
last_order_number_by_users_in_test_set = users_in_test_set.groupby("user_id")["order_number"].max().to_frame().reset_index()
last_order_number_by_users_in_test_set.head(10)

   user_id  order_number
0        3            13
1        4             6
2        6             4
3       11             8
4       12             6
5       15            23
6       16             7
7       19            10
8       20             5
9       22            16

In [37]:
second_last_order_number_for_users_in_test_set = last_order_number_by_users_in_test_set
second_last_order_number_for_users_in_test_set["order_number"] = second_last_order_number_for_users_in_test_set["order_number"]-1
second_last_order_number_for_users_in_test_set.head(10)

   user_id  order_number
0        3            12
1        4             5
2        6             3
3       11             7
4       12             5
5       15            22
6       16             6
7       19             9
8       20             4
9       22            15

In [41]:
second_to_last_orders_for_users_in_test_set = pd.merge(second_last_order_number_for_users_in_test_set,orders_df,on=('user_id','order_number'),how='left')
second_to_last_orders_for_users_in_test_set.head(10)
second_to_last_orders_for_users_in_test_set.drop(["order_number","eval_set","order_dow","order_hour_of_day","days_since_prior_order"],axis=1,inplace=True)

In [81]:
second_to_last_orders_for_users_in_test_set.head(10)

   user_id  order_id
0        3   1402502
1        4   2557754
2        6    998866
3       11   1468214
4       12    221248
5       15    487368
6       16   2000615
7       19     86918
8       20   2741696
9       22   2647850

In [ ]:
# prior_items_ordered_df[prior_items_ordered_df.isin(last_order_by_users_in_test_set["order_id"])]

In [52]:
products_prior = prior_items_ordered_df[["product_id","order_id"]]
products_last = last_items_ordered_df[["product_id","order_id"]]
all_products_and_orders = pd.concat([products_prior,products_last])

In [83]:
last_products_for_users_in_test_set = pd.merge(second_to_last_orders_for_users_in_test_set,all_products_and_orders,on='order_id',how='left')
last_products_for_users_in_test_set.drop("order_id",axis=1,inplace=True)

In [84]:
last_products_for_users_in_test_set.head()

   user_id  product_id
0        3       39190
1        3       18599
2        3       23650
3        3       21903
4        3       47766

In [141]:
last_products_for_users_in_test_set.query('user_id==187107')

        user_id  product_id
709486   187107       13740
709487   187107       34126
709488   187107       44422
709489   187107       29594
709490   187107       25890
709491   187107       24852
709492   187107       41787
709493   187107       23794
709494   187107        5134
709495   187107        2326

In [143]:
pd.merge(last_products_for_users_in_test_set.query('user_id==187107'),product_factors.reset_index(),on='product_id',how='left')

   user_id  product_id  product_reorder_factor
0   187107       13740                0.058824
1   187107       34126                     NaN
2   187107       44422                     NaN
3   187107       29594                0.218750
4   187107       25890                0.259259
5   187107       24852                     NaN
6   187107       41787                0.250000
7   187107       23794                0.317647
8   187107        5134                0.407407
9   187107        2326                0.111111

In [87]:
orders_in_test_set = orders_df[orders_df["eval_set"]=="test"].drop(["eval_set","order_number","order_dow","order_hour_of_day","days_since_prior_order"],axis=1)

In [88]:
orders_in_test_set.head(10)

     order_id  user_id
38    2774568        3
44     329954        4
53    1528013        6
96    1376945       11
102   1356845       12
152   2161313       15
159   1416320       16
217   1735923       19
222   1980631       20
272    139655       22

In [140]:
orders_in_test_set.query('order_id ==137')

         order_id  user_id
3102779       137   187107

In [89]:
product_factors.head()

            product_reorder_factor
product_id
1                              NaN
2                         0.614627
3                         0.138298
4                         0.738516
5                         0.458689

In [155]:
THRESHOLD = 0.5

submission = pd.merge(
pd.merge(   
    pd.merge(
        orders_in_test_set,
        last_products_for_users_in_test_set,
        on='user_id',
        how='left'
    ).drop("user_id",axis=1),
    product_factors.reset_index(),
    on='product_id',
    how='left'
).query(
        "product_reorder_factor > {}".format(THRESHOLD)
).groupby(
    "order_id"
)["product_id"].apply(
     lambda prod_ids: ' '.join([str(int(i)) for i in sorted(set(prod_ids)) ])
).to_frame().reset_index().sort_values("order_id"),
orders_in_test_set,
    on="order_id",
    how="right").sort_values("order_id")[["order_id","product_id"]].fillna("None")

In [156]:
submission.rename(columns={"product_id":"products"}).to_csv("submission.csv",index=False)